app/Http/Livewire/CreateIdea.php

insert into `ideas` (`user_id`, `category_id`, `status_id`, `title`, `description`, `slug`, `updated_at`, `created_at`) values (21, '2', 1, 'pomysl test', 'test test', 'pomysl-test', '2022-01-09 15:10:03', '2022-01-09 15:10:03')
---
    public function createIdea()
    {
            if (auth()->check()) {
                $this->validate();

                Idea::create([
                    'user_id' => auth()->id(),
                    'category_id' => $this->category,
                    'status_id' => 1,
                    'title' => $this->title,
                    'description' => $this->description,

            ]);

select * from `categories`
---
    public function render()
    {
        return view('livewire.create-idea', [
            'categories' => Category::all(),
        ]);