app/Http/Livewire/IdeasIndex.php

select * from `categories`
select * from `categories` where `categories`.`id` in (1, 2, 3, 4)
select * from `statuses` where `statuses`.`id` in (1, 2, 3, 4, 5)
select * from `users` where `users`.`id` in (1, 4, 6, 7, 10, 11, 12, 13, 18)
select `ideas`.*, (select `id` from `votes` where `user_id` is null and `idea_id` = `ideas`.`id`) as `voted_by_user`, (select count(*) from `users` inner join `votes` on `users`.`id` = `votes`.`user_id` where `ideas`.`id` = `votes`.`idea_id`) as `votes_count` from `ideas` where `status_id` = 2 order by `votes_count` desc, `id` desc limit 11 offset 0
---
    public function render()
    {
        $statuses = Status::all()->pluck('id', 'name');
        $categories = Category::all();

        return view('livewire.ideas-index', [
            'ideas' => Idea::with('user', 'category', 'status')
                ->when($this->status && $this->status !== 'Wszystkie', function ($query) use ($statuses) {
                    return $query->where('status_id', $statuses->get($this->status));
                })->when($this->category && $this->category !== 'Wszystkie', function ($query) use ($categories) {
                    return $query->where('category_id', $categories->pluck('id', 'name')->get($this->category));
                })->when($this->filter && $this->filter === 'Najlepsze', function ($query) {
                    return $query->orderByDesc('votes_count');
                })->when($this->filter && $this->filter === 'Moje pomysły', function ($query) {
                    return $query->where('user_id', auth()->id());
                })->when(strlen($this->search) >= 3, function ($query) {
                    return $query->where('title', 'like', '%'.$this->search.'%');
                })
                ->addSelect(['voted_by_user' => Vote::select('id')
                    ->where('user_id', auth()->id())
                    ->whereColumn('idea_id', 'ideas.id')
                ])
                ->withCount('votes')
                ->latest('id')
                ->simplePaginate(Idea::PAGINATION_COUNT),
            'categories' => $categories,
        ]);