app/Models/Idea.php

select exists(select * from `votes` where `user_id` = 21 and `idea_id` = 100) as `exists`
---
    public function isVotedByUser(?User $user)
    {
        if (!$user) {
            return false;
        }

        return Vote::where('user_id', $user->id)
            ->where('idea_id', $this->id)
            ->exists();

insert into `votes` (`idea_id`, `user_id`, `updated_at`, `created_at`) values (100, 21, '2022-01-08 16:45:50', '2022-01-08 16:45:50')
---
    public function vote(User $user)
    {
        Vote::create([
            'idea_id' => $this->id,
            'user_id' => $user->id,
        ]);

delete from `votes` where `id` = 1012
select * from `votes` where `idea_id` = 100 and `user_id` = 21 limit 1
---
    public function removeVote(User $user)
    {
        Vote::where('idea_id', $this->id)
            ->where('user_id', $user->id)
            ->first()
            ->delete();