app/Models/Status.php

    public static function getCount()
    {
        return Idea::query()
            ->selectRaw("count(*) as wszystkie_statuses")
            ->selectRaw("count(case when status_id = 1 then 1 end) as 'Nowy'")
            ->selectRaw("count(case when status_id = 2 then 1 end) as 'Rozważane'")
            ->selectRaw("count(case when status_id = 3 then 1 end) as 'W realizacji'")
            ->selectRaw("count(case when status_id = 4 then 1 end) as 'Zrealizowane'")
            ->selectRaw("count(case when status_id = 5 then 1 end) as 'Odrzucone'")
            ->first()
            ->toArray();
---
select count(*) as wszystkie_statuses, count(case when status_id = 1 then 1 end) as 'Nowy', count(case when status_id = 2 then 1 end) as 'Rozważane', count(case when status_id = 3 then 1 end) as 'W realizacji', count(case when status_id = 4 then 1 end) as 'Zrealizowane', count(case when status_id = 5 then 1 end) as 'Odrzucone' from `ideas` limit 1